import React from 'react'
import { useState } from 'react'

export default function Panel ({title, children}) {
    const [isActive , setIsActive]=useState(false)
  return (
    <div>
        <h3> {title} </h3>
        {
            isActive ? <p> {children} </p>
            : <button onClick={() => setIsActive(true)}> Show </button>
        }

    </div>
  )
}











// const { title, city} = city;


// export default function isActive (props) {
//     isActive = 
// }



// export default function HadleClick () {

// }





// `Улаанбаатар (ᠤᠯᠠᠭᠠᠨᠪᠠᠭᠠᠲᠤᠷ улаганбагатур, улаан-баа-тар)
//  нь Монгол Улсын нийслэл бөгөөд Монгол улсын цорын ганц 
//  саятан хот юм. 1992 оны шинэ нутаг дэвсгэрийн хуваариар 
//  үндсэн 6, дагуул 3, нийт 9 дүүрэгтэй, нутаг дэвсгэрийн хэмжээ 
//  4,704.4 км2 газартай. 2021 оны эцсээр 1,649,172 хүн оршин сууж байна.`


//  `Улаанбаатар хот Монгол Улсын төв хэсэгт хуучнаар Алтан тэвшийн 
//  хөндий, өнөөгийнхөөр Туул-Сэлбийн гол бэлчир хөндийд, далайн 
//  түвшнээс дээш 1300-1350 метр өндөрт Богд хан, Сонгино хайрхан, 
//  Чингэлтэй уул, Баянзүрх дөрвөн уулаар хүрээлэгдэн оршдог.
// 1639 онд Ширээт цагаан нуурт Өндөр гэгээнийг залж орд өргөө 
// боссоноор Улаанбаатар хотын өмнөх суурин байгуулагджээ. 1778 
// он хүртэл олон газар нүүдэллэж байгаад одоогийн байрлалдаа 
// тогтсон. Өмнө нь шашин, худалдааны төв байсан бол 1911 оноос 
// улсын нийслэл болж, XX зуунд барилгажиж, аж үйлдвэржиж, XXI
//  зуунд их хотын төрх бүрдэж байна. Улаанбаатар Монгол Улсын 
//  улс төр, эдийн засаг, соёл, технологийн төв юм.`
